#!/bin/bash
# 统计每秒访问量最大的IP
# 不知道出题人是不是想要这样的结果
# 13:10:02       3 192.168.3.10
# 13:10:03       1 192.168.3.10
# 13:10:04       3 192.168.3.11
# 13:10:05       4 192.168.3.13
# 13:10:07       2 192.168.3.14
# 13:10:09       1 192.168.3.16
# 13:10:10       1 192.168.3.17
# 13:10:11       1 192.168.3.17
# 13:10:12       1 192.168.3.17

for item in `cat access.log |awk '{sum[$2]=sum[$2]"#"$1}END{for(a in sum) {print a","sum[a]}}' `;do 
	t=`echo $item|cut -f1 -d','`; ip=`echo $item|cut -f2 -d',' |tr '#' '\n' |sort |uniq -c |sort -nr |head -n 1`;echo "$t $ip";
done |sort 